{
  "mbti": [
    {
      "code": "ABFR",
      "title": {
        "blue": "Alipic",
        "purple": "Blemish-Prone",
        "green": "Sensitive",
        "yellow": "Redness Warning Type"
      },
      "description": "You have alipic skin (A), pigment concern type (B), oil-water balance F, and reactive type R. Your skin tends to be dry and prone to flakiness, with concerns about blemishes and dark circles. It's also sensitive and easily flushed, so reducing irritation and focusing on calming care will be helpful."
    },
    {
      "code": "ABFW",
      "title": {
        "blue": "Alipic",
        "purple": "Blemish-Prone",
        "green": "Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have alipic skin (A), pigment concern type (B), oil-water balance F, and whitening-focused reactive type (W). Your skin is dry and prone to flakiness, and you may struggle with blemishes and dark circles. A skincare routine focused on brightening and improving overall tone will be beneficial."
    },
    {
      "code": "ABSR",
      "title": {
        "blue": "Alipic",
        "purple": "Blemish-Prone",
        "green": "Oily-Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have alipic skin (A), pigment concern type (B), sebum-prone balance type (S), and reactive type (R). Your skin is dry and sensitive, with concerns not only about blemishes and dark circles, but also excess sebum and blackheads. A soothing skincare routine that minimizes irritation is essential."
    },
    {
      "code": "ABSW",
      "title": {
        "blue": "Alipic",
        "purple": "Blemish-Prone",
        "green": "Oily-Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have alipic skin (A), pigment concern type (B), sebum-prone balance type (S), and whitening-focused type (W). Your skin is generally dry and prone to flakiness, with noticeable pigmentation and dark circles, along with excessive sebum and blackhead issues. Intensive moisturizing and pore care focused on tone correction and brightening is necessary."
    },
    {
      "code": "AEFR",
      "title": {
        "blue": "Alipic",
        "purple": "Elasticity-Concerning",
        "green": "Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have alipic skin (A), elasticity concern type (E), oil-water balance F, and reactive type (R). Your skin is generally dry and prone to frequent flakiness, accompanied by reduced elasticity and enlarged pores. Sebum production is active, leading to frequent blackheads. Due to your skin’s sensitivity and tendency to flush easily, a gentle, low-irritation skincare routine is essential."
    },
    {
      "code": "AEFW",
      "title": {
        "blue": "Alipic",
        "purple": "Elasticity-Concerning",
        "green": "Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have alipic skin (A), elasticity concern type (E), oil-water balance F, and whitening-focused type (W). Your skin is dry and prone to flakiness, with reduced elasticity and a dull skin tone. Intensive care focused on both brightening and moisturizing is essential."
    },
    {
      "code": "AESR",
      "title": {
        "blue": "Alipic",
        "purple": "Elasticity-Concerning",
        "green": "Oily-Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have alipic skin (A), elasticity concern type (E), sebum-prone balance type (S), and reactive type (R). Your skin is dry with frequent flakiness, decreased elasticity, and enlarged pores. Excessive sebum and blackheads are common, and your skin is sensitive and easily reddened. A customized routine focused on calming and reducing irritation is essential."
    },
    {
      "code": "AESW",
      "title": {
        "blue": "Alipic",
        "purple": "Elasticity-Concerning",
        "green": "Oily-Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have alipic skin (A), elasticity concern type (E), sebum-prone balance type (S), and whitening-focused type (W). You may experience multiple concerns such as rough skin texture, reduced firmness, excess sebum, and blackheads. A well-balanced skincare routine that targets hydration, elasticity, and brightening is essential."
    },
    {
      "code": "NBFR",
      "title": {
        "blue": "Balanced",
        "purple": "Blemish-Prone",
        "green": "Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have neutral skin type (N), pigment concern type (B), oil-water balance F, and reactive type (R). Your skin shows both dryness and oiliness, indicating a combination type. You may have concerns like blemishes, dark circles, and flakiness, along with sensitivity. A delicate routine focused on calming and hydration is needed."
    },
    {
      "code": "NBFW",
      "title": {
        "blue": "Balanced",
        "purple": "Blemish-Prone",
        "green": "Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have neutral skin type (N), pigment concern type (B), oil-water balance F, and whitening-focused type (W). You have combination skin with oiliness in the T-zone and dryness in the U-zone. Concerns may include blemishes, dark circles, and flakiness. A gentle skincare routine focused on brightening and tone correction is essential."
    },
    {
      "code": "NBSR",
      "title": {
        "blue": "Balanced",
        "purple": "Blemish-Prone",
        "green": "Oily-Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have neutral skin type (N), pigment concern type (B), sebum-prone balance type (S), and reactive type (R). You have sensitive combination skin with oiliness in the T-zone and dryness in the U-zone. Concerns include blemishes, dark circles, and blackheads. A calming skincare routine focused on reducing irritation is essential."
    },
    {
      "code": "NBSW",
      "title": {
        "blue": "Balanced",
        "purple": "Blemish-Prone",
        "green": "Oily-Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have neutral skin type (N), pigment concern type (B), sebum-prone balance type (S), and whitening-focused type (W). You have combination skin with an oily T-zone and a dry U-zone. You may struggle with blemishes, dark circles, excess sebum, and blackheads. Brightening care is important to achieve a clear and even skin tone."
    },
    {
      "code": "NEFR",
      "title": {
        "blue": "Balanced",
        "purple": "Elasticity-Concerning",
        "green": "Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "피부타입 N, 색소축 E, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. T존은 유분이 많고 U존은 건조한 복합성 피부로, 탄력 저하와 각질, 건조함이 동반되며, 민감하고 쉽게 붉어지는 특성으로 인해 자극을 줄이는 진정 관리가 필요합니다."
    },
    {
      "code": "NEFW",
      "title": {
        "blue": "Balanced",
        "purple": "Elasticity-Concerning",
        "green": "Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have neutral skin type (N), elasticity concern type (E), oil-water balance F, and reactive type (R). You have combination skin with an oily T-zone and a dry U-zone. You may experience reduced elasticity, flakiness, and dryness. Due to sensitivity and a tendency to flush easily, calming care that minimizes irritation is necessary."
    },
    {
      "code": "NESR",
      "title": {
        "blue": "Balanced",
        "purple": "Elasticity-Concerning",
        "green": "Oily-Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have neutral skin type (N), elasticity concern type (E), sebum-prone balance type (S), and reactive type (R). Your T-zone is oily and your U-zone is dry. You have concerns about decreased elasticity and enlarged pores. Excess sebum and blackheads are also present. Since your skin is sensitive and easily flushed, irritation-reducing care is necessary."
    },
    {
      "code": "NESW",
      "title": {
        "blue": "Balanced",
        "purple": "Elasticity-Concerning",
        "green": "Oily-Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have neutral skin type (N), elasticity concern type (E), sebum-prone balance type (S), and whitening-focused type (W). Your T-zone is oily and your U-zone is dry. You experience reduced skin elasticity and pore issues, along with excessive sebum and blackheads. Brightening and tone correction should be prioritized in your skincare routine."
    },
    {
      "code": "OBFR",
      "title": {
        "blue": "Oily",
        "purple": "Blemish-Prone",
        "green": "Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have oily skin (O), pigment concern type (B), oil-water balance F, and reactive type (R). Your skin produces excess sebum and requires pore care. You are concerned about blemishes and dark circles, along with flakiness and dryness. Since your skin is sensitive and easily reddened, calming care that reduces irritation is important.You have oily skin (O), pigment concern type (B), oil-water balance F, and reactive type (R). Your skin produces excess sebum and requires pore care. You are concerned about blemishes and dark circles, along with flakiness and dryness. Since your skin is sensitive and easily reddened, calming care that reduces irritation is important.You have oily skin (O), pigment concern type (B), oil-water balance F, and reactive type (R). Your skin produces excess sebum and requires pore care. You are concerned about blemishes and dark circles, along with flakiness and dryness. Since your skin is sensitive and easily reddened, calming care that reduces irritation is important."
    },
    {
      "code": "OBFW",
      "title": {
        "blue": "Oily",
        "purple": "Blemish-Prone",
        "green": "Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have oily skin (O), pigment concern type (B), oil-water balance F, and whitening-focused type (W). Your skin produces a lot of sebum and needs pore care. Blemishes and dark circles are a concern, along with flakiness and dryness. Focused brightening and tone correction care is necessary."
    },
    {
      "code": "OBSR",
      "title": {
        "blue": "Oily",
        "purple": "Blemish-Prone",
        "green": "Oily-Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have oily skin (O), pigment concern type (B), sebum-prone balance type (S), and reactive type (R). Your skin produces a lot of sebum and needs pore care. You may struggle with blemishes, dark circles, excess oil, and frequent blackheads. Since your skin is sensitive and easily reddened, calming care that reduces irritation is necessary."
    },
    {
      "code": "OBSW",
      "title": {
        "blue": "Oily",
        "purple": "Blemish-Prone",
        "green": "Oily-Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have oily skin (O), pigment concern type (B), sebum-prone balance type (S), and whitening-focused type (W). Your skin produces excess sebum and requires pore care. Blemishes and dark circles are concerns, and blackheads occur frequently. Skincare should focus on brightening and improving overall tone."
    },
    {
      "code": "OEFR",
      "title": {
        "blue": "Oily",
        "purple": "Elasticity-Concerning",
        "green": "Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have oily skin (O), elasticity concern type (E), oil-water balance F, and reactive type (R). Excess sebum causes oiliness and enlarged pores. Skin elasticity is reduced, and you may experience dryness and flakiness. With sensitive skin prone to redness, a gentle, low-irritation skincare routine is necessary."
    },
    {
      "code": "OEFW",
      "title": {
        "blue": "Oily",
        "purple": "Elasticity-Concerning",
        "green": "Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have oily skin (O), elasticity concern type (E), oil-water balance F, and whitening-focused type (W). Active sebum production causes oiliness and noticeable pores. Elasticity is reduced, and dryness and flakiness may lead to rough texture and a dull complexion. Intensive care focused on brightening and tone correction is needed."
    },
    {
      "code": "OESR",
      "title": {
        "blue": "Oily",
        "purple": "Elasticity-Concerning",
        "green": "Oily-Sensitive",
        "yellow": "Redness Warning"
      },
      "description": "You have oily skin (O), elasticity concern type (E), sebum-prone balance type (S), and reactive type (R). Excessive sebum leads to greasiness and enlarged pores, along with frequent blackheads and breakouts. Reduced elasticity causes sagging, and sensitivity with redness makes the skin vulnerable to external irritation. A calming and sebum-controlling routine is essential."
    },
    {
      "code": "OESW",
      "title": {
        "blue": "Oily",
        "purple": "Elasticity-Concerning",
        "green": "Oily-Sensitive",
        "yellow": "Whitening-Focused"
      },
      "description": "You have oily skin (O), elasticity concern type (E), sebum-prone balance type (S), and whitening-focused type (W). Your skin produces excess sebum, resulting in greasiness and enlarged pores, with frequent oily breakouts like blackheads. Loss of elasticity causes sagging, and overall tone appears dull. Focused care on oil control and whitening is recommended."
    }
  ],
  "skinTypes": {
    "A": {
      "label": "Alipic Skin Type",
      "features": [
        "This skin type is naturally low in sebum and has small pores, resulting in a lack of both oil and moisture.",
        "After cleansing, the entire face often feels tight or shows flakiness.",
        "The skin barrier is weak and can react sensitively to external irritants."
      ],
      "tips": [
        "Avoid excessive cleansing, and consistently use deeply hydrating moisturizers.",
        "Choose moisture-focused products rather than those that are overly oily.",
        "Reinforce hydration when exposed to dry environments like heaters or air conditioning."
      ]
    },
    "N": {
      "label": "Normal/Combination Skin Type",
      "features": [
        "The T-zone (forehead and nose) tends to be oily, while the U-zone (cheeks and jawline) is often dry.",
        "Skin condition can vary depending on the season and environmental changes.",
        "In the case of truly normal skin, oil and moisture are well-balanced, without excessive shine or tightness."
      ],
      "tips": [
        "Customized care is needed for each facial zone.The T-zone should be managed with a focus on oil control, like oily skin, while the U-zone requires moisture-focused care, similar to dry skin.",
        "Maintain a good balance between cleansing and moisturizing, and adjust your skincare routine according to seasonal changes."
      ]
    },
    "O": {
      "label": "Oily Skin Type",
      "features": [
        "Large pores and active sebum production cause overall oiliness, often leading to makeup breaking down by the afternoon.",
        "Prone to blackheads, acne, and other skin troubles.",
        "Sebum production peaks during adolescence to early 20s, then gradually stabilizes over time."
      ],
      "tips": [
        "Use proper cleansing to remove excess sebum, but avoid over-washing, as it can stimulate more oil production.",
        "Use products that manage pores and help balance oil and moisture.",
        "Reducing intake of greasy or sugary foods may also help improve skin condition."
      ]
    }
  },
  "pigment": {
    "B": {
      "label": "Pigmentation/Tone Concern Type",
      "features": [
        "The skin often appears dull or uneven in tone, and dark circles, melasma, and blemishes are easily noticeable.",
        "Pigmentation can be caused by factors such as UV exposure, fatigue, stress, or post-inflammatory responses."
      ],
      "tips": [
        "Sun protection is essential! Use basic skincare products containing brightening ingredients like niacinamide or arbutin.",
        "Add tone-up or brightening ampoules/serums to your routine.",
        "Getting enough sleep, consuming vitamin C, and blocking blue light can also help improve skin tone."
      ]
    },
    "E": {
      "label": "Structural/Elasticity Concern Type",
      "features": [
        "This type is concerned with loss of elasticity, wrinkles, and sagging or enlarged pores.",
        "These issues are often caused by collagen reduction and weakened skin support structures, and can occur regardless of age due to skin barrier damage or UV exposure."
      ],
      "tips": [
        "Use functional cosmetics containing ingredients that promote collagen synthesis (e.g., retinol, peptides, adenosine).",
        "Combine your routine with massage tools or lifting devices for enhanced results.",
        "Sleep, hydration, and sun protection are essential for maintaining skin firmness."
      ]
    }
  },
  "moisture": {
    "F": {
      "label": "건조·예민형",
      "features": [
        "Skin is Alipic and sensitive, often showing signs of flakiness, tightness, rough texture, and redness.",
        "It reacts sensitively to environmental changes, seasons, stress, and improper cleansing habits."
      ],
      "tips": [
        "Focus on low-irritation moisturizers and barrier-strengthening ingredients like ceramide, panthenol, and madecassoside.",
        "Avoid harsh cleansers and include hydrating and soothing masks in your routine.",
        "Use lukewarm water and short cleansing times, and minimize external irritation."
      ]
    },
    "S": {
      "label": "Oily & Impurity-Prone Type",
      "features": [
        "This type often experiences issues such as excessive sebum production, greasiness, blackheads, and whiteheads.",
        "Pores tend to enlarge easily, and there is a high likelihood of breakouts."
      ],
      "tips": [
        "Use sebum-controlling ingredients such as salicylic acid (BHA), niacinamide, and clay masks 2–3 times a week.",
        "Focus on pore cleansing and maintaining oil-water balance, while ensuring adequate hydration.",
        "Limiting greasy food intake and getting sufficient sleep can also help."
      ]
    }
  },
  "Reactivity": {
    "R": {
      "label": "Sensitive/Redness-Prone Type",
      "features": [
        "The skin is extremely sensitive to irritation and often shows redness or burning sensations after cleansing.",
        "These symptoms may result from a weakened skin barrier or hypersensitive endogenous immune responses."
      ],
      "tips": [
        "It is recommended to use soothing ingredients such as Centella Asiatica, panthenol, madecassoside, and allantoin.",
        "Switch to a routine focusing on low-irritation, fragrance-free, and alcohol-free products.",
        "Habits that reduce temperature fluctuations and stress are also very important."
      ]
    },
    "W": {
      "label": "Brightening/Tone Concern Type",
      "features": [
        "The overall skin tone appears dull or lacks vitality, with concerns about dark spots or pigmentation and a strong interest in brightening care.",
        "Environmental pollution, UV exposure, and aging significantly contribute to uneven or reduced skin tone."
      ],
      "tips": [
        "Use brightening functional products (Vitamin C, arbutin, niacinamide) consistently in both morning and evening routines.",
        "High SPF sunscreens are essential all year round.",
        "Combining with moisturizing care that helps restore the skin barrier enhances the effect."
      ]
    }
  }
}
