{
  "mbti": [
    {
      "code": "ABFR",
      "title": {
        "blue": "건조한",
        "purple": "잡티고민",
        "green": "예민보스",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 A, 색소축 B, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. 피부가 다소 건조하고 각질이 쉽게 생기며, 잡티와 다크서클이 고민이실 수 있어요. 또한 예민하고 붉어지기 쉬운 피부이기 때문에, 자극을 줄이고 진정에 집중한 관리가 도움이 됩니다."
    },
    {
      "code": "ABFW",
      "title": {
        "blue": "건조한",
        "purple": "잡티고민",
        "green": "예민보스",
        "yellow": "미백집중형"
      },
      "description": "피부타입 A, 색소축 B, 수분유분축 F, 반응성축 W에 해당하는 피부입니다. 건조하고 각질이 잘 생기는 피부로, 잡티와 다크서클이 고민이 될 수 있어 미백과 톤 개선 중심의 케어가 필요해요."
    },
    {
      "code": "ABSR",
      "title": {
        "blue": "건조한",
        "purple": "잡티고민",
        "green": "피지폭발",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 A, 색소축 B, 수분유분축 S, 반응성축 R에 해당하는 피부입니다. 피부가 건조하고 예민한 편으로, 잡티·다크서클뿐 아니라 피지와 블랙헤드 고민까지 있어 자극을 줄이고 진정 중심의 관리가 필요해요."
    },
    {
      "code": "ABSW",
      "title": {
        "blue": "건조한",
        "purple": "잡티고민",
        "green": "피지폭발",
        "yellow": "미백집중형"
      },
      "description": "피부타입 A, 색소축 B, 수분유분축 S, 반응성축 W에 해당하는 피부입니다. 피부가 전반적으로 건조하고 각질이 쉽게 발생하며, 색소 침착과 다크서클이 눈에 띄고 피지 분비와 블랙헤드 문제도 동반되어 있습니다. 피부 톤 개선과 미백을 위한 집중적인 보습 및 모공 관리가 필요합니다."
    },
    {
      "code": "AEFR",
      "title": {
        "blue": "건조한",
        "purple": "탄력고민",
        "green": "예민보스",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 A, 색소축 E, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. 피부가 전반적으로 건조하며 각질이 자주 발생하고, 탄력 저하와 모공 확장 문제가 동반됩니다. 피지 분비가 활발하고 블랙헤드가 쉽게 생기며, 예민하고 쉽게 붉어지는 피부 특성상 저자극 중심의 섬세한 관리가 필요합니다."
    },
    {
      "code": "AEFW",
      "title": {
        "blue": "건조한",
        "purple": "탄력고민",
        "green": "예민보스",
        "yellow": "미백집중형"
      },
      "description": "피부타입 A, 색소축 E, 수분유분축 F, 반응성축 W에 해당하는 피부입니다.  피부가 건조하고 각질이 자주 발생하며, 탄력 저하와 칙칙한 피부 톤이 동반되어 미백과 보습 중심의 집중 관리가 필요합니다."
    },
    {
      "code": "AESR",
      "title": {
        "blue": "건조한",
        "purple": "탄력고민",
        "green": "피지폭발",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 A, 색소축 E, 수분유분축 S, 반응성축 R에 해당하는 피부입니다. 건조함과 각질, 탄력 저하로 모공이 넓어지고 피지 과다 및 블랙헤드가 동반되며, 예민하고 붉어지기 쉬운 피부로 자극 완화 중심의 맞춤 관리가 필요합니다."
    },
    {
      "code": "AESW",
      "title": {
        "blue": "건조한",
        "purple": "탄력고민",
        "green": "피지폭발",
        "yellow": "미백집중형"
      },
      "description": "피부타입 A, 색소축 E, 수분유분축 S, 반응성축 W에 해당하는 피부입니다. 피부결 저하와 탄력 감소, 피지·블랙헤드 문제로 복합적인 고민이 있으며, 수분·탄력·미백을 아우르는 균형 잡힌 관리가 필요합니다."
    },
    {
      "code": "NBFR",
      "title": {
        "blue": "균형잡힌",
        "purple": "잡티고민",
        "green": "예민보스",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 N, 색소축 B, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. 유분과 건조가 동시에 나타나는 복합성 피부로, 잡티·다크서클·각질 고민과 함께 민감성이 있어 진정과 보습 중심의 섬세한 관리가 요구됩니다."
    },
    {
      "code": "NBFW",
      "title": {
        "blue": "균형잡힌",
        "purple": "잡티고민",
        "green": "예민보스",
        "yellow": "미백집중형"
      },
      "description": "피부타입 N, 색소축 B, 수분유분축 F, 반응성축 W에 해당하는 피부입니다. T존의 유분과 U존의 건조가 공존하는 복합성 피부로, 잡티·다크서클·각질 고민이 있으며  미백과 톤 개선을 위한 섬세한 케어가 필요합니다."
    },
    {
      "code": "NBSR",
      "title": {
        "blue": "균형잡힌",
        "purple": "잡티고민",
        "green": "피지폭발",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 N, 색소축 B, 수분유분축 S, 반응성축 R에 해당하는 피부입니다. T존의 유분과 U존의 건조가 공존하는 민감한 복합성 피부로, 잡티·다크서클·블랙헤드 고민이 있으며 , 자극을 줄이는 진정 중심의 케어가 필요합니다."
    },
    {
      "code": "NBSW",
      "title": {
        "blue": "균형잡힌",
        "purple": "잡티고민",
        "green": "피지폭발",
        "yellow": "미백집중형"
      },
      "description": "피부타입 N, 색소축 B, 수분유분축 S, 반응성축 W에 해당하는 피부입니다. T존은 유분이 많고 U존은 건조한 복합성 피부로, 잡티와 다크서클, 피지 과다와 블랙헤드 고민이 있으며 깨끗하고 균일한 톤을 위한 미백 케어가 중요합니다."
    },
    {
      "code": "NEFR",
      "title": {
        "blue": "균형잡힌",
        "purple": "탄력고민",
        "green": "예민보스",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 N, 색소축 E, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. T존은 유분이 많고 U존은 건조한 복합성 피부로, 탄력 저하와 각질, 건조함이 동반되며, 민감하고 쉽게 붉어지는 특성으로 인해 자극을 줄이는 진정 관리가 필요합니다."
    },
    {
      "code": "NEFW",
      "title": {
        "blue": "균형잡힌",
        "purple": "탄력고민",
        "green": "예민보스",
        "yellow": "미백집중형"
      },
      "description": "피부타입 N, 색소축 E, 수분유분축 F, 반응성축 W에 해당하는 피부입니다. T존은 유분이 많고 U존은 건조한 복합성 피부로, 탄력 저하와 각질, 건조함이 함께 나타나 미백과 톤 개선 관리가 필요합니다."
    },
    {
      "code": "NESR",
      "title": {
        "blue": "균형잡힌",
        "purple": "탄력고민",
        "green": "피지폭발",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 N, 색소축 E, 수분유분축 S, 반응성축 R에 해당하는 피부입니다. T존은 유분이 많고 U존은 건조합니다. 피부 탄력 저하와 모공 고민이 있습니다. 피지 과다와 블랙헤드 문제도 동반됩니다. 피부가 쉽게 붉어지고 민감한 편이라 자극을 줄이는 관리가 필요합니다."
    },
    {
      "code": "NESW",
      "title": {
        "blue": "균형잡힌",
        "purple": "탄력고민",
        "green": "피지폭발",
        "yellow": "미백집중형"
      },
      "description": "피부타입 N, 색소축 E, 수분유분축 S, 반응성축 W에 해당하는 피부입니다. T존은 유분이 많고 U존은 건조합니다. 피부 탄력 저하와 모공 고민이 있습니다. 피지 과다와 블랙헤드 문제도 동반됩니다. 미백과 톤 개선에 신경 써야 합니다."
    },
    {
      "code": "OBFR",
      "title": {
        "blue": "번들거리는",
        "purple": "잡티고민",
        "green": "예민보스",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 O, 색소축 B, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. 피지 분비가 많고 모공 관리가 필요합니다. 잡티와 다크서클이 고민이며, 각질과 건조함도 동반됩니다. 피부가 쉽게 붉어지고 민감한 편이라 자극을 줄이는 관리가 필요합니다."
    },
    {
      "code": "OBFW",
      "title": {
        "blue": "번들거리는",
        "purple": "잡티고민",
        "green": "예민보스",
        "yellow": "미백집중형"
      },
      "description": "피부타입 O, 색소축 B, 수분유분축 F, 반응성축 W에 해당하는 피부입니다. 피지 분비가 많고 모공 관리가 필요합니다.잡티와 다크서클이 고민이며,각질과 건조함도 동반됩니다. 미백과 톤 개선에 신경 써야 합니다."
    },
    {
      "code": "OBSR",
      "title": {
        "blue": "번들거리는",
        "purple": "잡티고민",
        "green": "피지폭발",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 O, 색소축 B, 수분유분축 S, 반응성축 R에 해당하는 피부입니다. 피지 분비가 많고 모공 관리가 필요합니다.잡티와 다크서클이 고민이며, 피지 과다와 블랙헤드가 자주 발생합니다.피부가 쉽게 붉어지고 민감한 편이라 자극을 줄이는 관리가 필요합니다."
    },
    {
      "code": "OBSW",
      "title": {
        "blue": "번들거리는",
        "purple": "잡티고민",
        "green": "피지폭발",
        "yellow": "미백집중형"
      },
      "description": "피부타입 O, 색소축 B, 수분유분축 S, 반응성축 W에 해당하는 피부입니다. 피지 분비가 많고 모공 관리가 필요합니다. 잡티와 다크서클이 고민이며, 피지 과다와 블랙헤드가 자주 발생합니다. 미백과 톤 개선에 신경 써야 합니다."
    },
    {
      "code": "OEFR",
      "title": {
        "blue": "번들거리는",
        "purple": "탄력고민",
        "green": "예민보스",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 O, 색소축 E, 수분유분축 F, 반응성축 R에 해당하는 피부입니다. 피지 분비가 활발해 번들거림과 넓은 모공이 두드러지며, 피부 탄력이 저하된 상태입니다. 각질과 건조함도 함께 나타나며, 민감한 피부로 자극에 쉽게 반응하므로 저자극 위주의 섬세한 관리가 필요합니다."
    },
    {
      "code": "OEFW",
      "title": {
        "blue": "번들거리는",
        "purple": "탄력고민",
        "green": "예민보스",
        "yellow": "미백집중형"
      },
      "description": "피부타입 O, 색소축 E, 수분유분축 F, 반응성축 W에 해당하는 피부입니다. 피지 분비가 활발하여 번들거림과 넓은 모공이 두드러지며, 피부 탄력이 저하된 상태입니다. 각질과 건조함이 동반되어 피부 결이 거칠 수 있고, 전체적인 안색이 칙칙해 보일 수 있어 미백과 톤 개선 중심의 집중 케어가 필요합니다."
    },
    {
      "code": "OESR",
      "title": {
        "blue": "번들거리는",
        "purple": "탄력고민",
        "green": "피지폭발",
        "yellow": "홍조주의형"
      },
      "description": "피부타입 O, 색소축 E, 수분유분축 S, 반응성축 R에 해당하는 피부입니다. 피지 분비가 과도하게 이루어져 번들거림과 모공 확장이 눈에 띄며, 블랙헤드와 같은 트러블이 자주 발생합니다. 피부 탄력이 저하되어 탄탄함이 부족하고, 민감성과 홍조 반응이 동반되어 외부 자극에 특히 취약합니다. 저자극 진정 케어와 함께 피지 조절 중심의 세심한 관리가 필요합니다."
    },
    {
      "code": "OESW",
      "title": {
        "blue": "번들거리는",
        "purple": "탄력고민",
        "green": "피지폭발",
        "yellow": "미백집중형"
      },
      "description": "피부타입 O, 색소축 E, 수분유분축 S, 반응성축 W에 해당하는 피부입니다. 피지가 과도하게 분비되어 번들거림과 모공 확장이 두드러지며, 블랙헤드 등 피지성 트러블이 자주 발생합니다. 피부 탄력이 저하되어 처짐이 고민되며, 전반적인 피부 톤 개선과 미백 관리가 필요한 피부 유형입니다. 유분 조절과 함께 미백 집중 케어가 추천됩니다."
    }
  ],
  "skinTypes": {
    "A": {
      "label": "건성",
      "features": [
        "선천적으로 모공이 작고 피지 분비량이 적어 유·수분이 모두 부족한 타입입니다.",
        "세안 후 얼굴 전체가 당기거나 각질이 일어나기 쉽습니다.",
        "피부 장벽이 약해 외부 자극에 민감하게 반응할 수 있습니다."
      ],
      "tips": [
        "지나친 세안을 피하고, 보습력이 강한 수분 크림을 꾸준히 사용하는 것이 중요합니다.",
        "유분이 과도하게 함유된 제품보다는 수분 공급 중심의 제품을 사용하는 것이 좋습니다.",
        "히터, 에어컨 바람 등 건조한 환경에 노출될 때 보습을 강화하세요."
      ]
    },
    "N": {
      "label": "복합성",
      "features": [
        "T존(이마, 코) 부위는 번들거리지만, U존(볼, 턱) 부위는 건조한 특징을 가진다",
        "계절, 환경 변화에 따라 피부 컨디션이 달라질 수 있습니다.",
        "중성피부의 경우는 유·수분 균형이 잘 맞고, 특별히 번들거리거나 당기지 않습니다"
      ],
      "tips": [
        "부위별로 맞춤 케어가 필요합니다. T존은 지성 피부처럼 유분 컨트롤 중심 관리해야 하며, U존은 건성 피부처럼 보습 중심으로 관리해야 합니다.",
        "클렌징과 보습의 균형이 중요하며, 계절에 따라 스킨케어 루틴을 조절하세요."
      ]
    },
    "O": {
      "label": "지성",
      "features": [
        "모공이 크고 피지 분비가 활발하여 오후에는 화장이 쉽게 무너지며 유분이 전체적으로 퍼집니다.",
        "블랙헤드, 여드름, 트러블 등이 생기기 쉬운 타입입니다.",
        "주로 사춘기~20대 초반에 피지 분비가 최고조에 이르며, 이후 점차 안정되기도 합니다"
      ],
      "tips": [
        "적절한 클렌징으로 과도한 피지를 제거하되, 과한 세안은 오히려 피지 분비를 자극할 수 있습니다.",
        "모공 관리와 유수분 밸런스를 맞춰주는 제품을 사용하는 것이 좋습니다.",
        "기름진 음식이나 당분 섭취를 줄이는 것도 도움이 됩니다."
      ]
    }
  },
  "pigment": {
    "B": {
      "label": "색소/톤 고민형",
      "features": [
        "피부가 칙칙하거나 얼룩덜룩한 톤을 띠며, 다크서클, 기미, 잡티가 눈에 띄기 쉽습니다.",
        "색소 침착은 자외선, 피로, 스트레스, 염증 후 반응 등으로 발생할 수 있습니다."
      ],
      "tips": [
        "자외선 차단은 필수! 기초부터 미백 기능성 성분(나이아신아마이드, 알부틴 등)이 포함된 제품 사용을 추천합니다",
        "피부 톤업/브라이트닝 케어를 위한 앰플이나 세럼을 루틴에 포함시키는 것이 좋습니다.",
        "충분한 수면, 비타민 C 섭취, 블루라이트 차단도 도움이 됩니다."
      ]
    },
    "E": {
      "label": "구조/탄력 고민형",
      "features": [
        "탄력 저하, 주름, 늘어진 모공 등이 고민인 타입입니다.",
        "콜라겐 감소, 피부 지지구조 약화로 인한 문제이며, 나이와 상관없이 피부 장벽 약화, 자외선 노출로도 발생합니다."
      ],
      "tips": [
        "콜라겐 합성을 촉진하는 성분(레티놀, 펩타이드, 아데노신) 위주의 기능성 화장품을 사용하세요.",
        "마사지 도구나 리프팅 디바이스를 병행해주는 것도 효과적입니다.",
        "수면, 수분 보충, 자외선 차단은 필수 관리요소입니다."
      ]
    }
  },
  "moisture": {
    "F": {
      "label": "건조·예민형",
      "features": [
        "각질, 당김, 거칠음, 붉음증이 자주 나타나는 건조하고 예민한 피부입니다.",
        "환경 변화, 계절, 스트레스, 잘못된 세안 습관 등에 민감하게 반응합니다."
      ],
      "tips": [
        "저자극 보습제, 세라마이드, 판테놀, 마데카소사이드 등의 피부 장벽 강화 성분 중심으로 관리해주세요",
        "세정력이 강한 제품 피하기, 수분 진정팩 등으로 진정 케어를 병행해주세요.",
        "짧고 미온수 세안, 외부 자극 최소화도 중요합니다."
      ]
    },
    "S": {
      "label": "기름·노폐물형 ",
      "features": [
        "과잉 피지 분비, 번들거림, 블랙헤드/화이트헤드 등의 문제를 자주 겪는 타입입니다.",
        "모공이 확장되기 쉽고, 트러블 유발 가능성도 높습니다."
      ],
      "tips": [
        "살리실산(BHA), 니아신아마이드, 클레이 마스크 등의 피지 컨트롤 성분을 주 2~3회 사용.",
        "모공 세정과 유수분 밸런스 유지가 핵심이며, 수분 공급은 병행되어야 합니다.",
        "기름진 음식 섭취 제한, 충분한 수면도 도움이 됩니다."
      ]
    }
  },
  "Reactivity": {
    "R": {
      "label": "민감/홍조형 ",
      "features": [
        "피부가 자극에 매우 민감하며, 세안 후 붉어짐/화끈거림 등의 증상이 자주 발생합니다",
        "피부 장벽이 약해진 상태, 혹은 내인성 면역 반응 과민으로 인한 증상입니다"
      ],
      "tips": [
        "센텔라아시아티카, 판테놀, 마데카소사이드, 알란토인 등의 진정 성분 사용을 추천합니다",
        "저자극, 무향, 무알콜 제품 위주 루틴으로 전환하면 좋습니다",
        "온도 변화와 스트레스를 줄이는 습관도 매우 중요합니다"
      ]
    },
    "W": {
      "label": "미백/톤 고민형",
      "features": [
        "피부톤이 전체적으로 칙칙하거나 생기가 부족, 기미·잡티가 걱정되거나 미백 관리에 관심이 많은 상태입니다",
        "환경 오염, 자외선, 노화 등이 피부톤 저하에 큰 영향을 미칩니다"
      ],
      "tips": [
        "미백 기능성 제품(비타민C, 알부틴, 나이아신아마이드)을 아침/저녁 루틴에 꾸준히 사용하세요",
        "SPF 지수가 높은 자외선 차단제는 사계절 필수입니다",
        "피부 장벽을 회복하는 보습 케어와 병행하면 효과가 더욱 높아집니다."
      ]
    }
  }
}
